{
    "basic_info": {
        "description_header": "Hola",
        "description": "Hola, mi nombre es Melo, pero también me llaman Melodic. Soy un desarrollador de software con experiencia en pequeñas empresas. Me aventuré en el dinámico mundo del desarrollo de software impulsado por mi pasión por la tecnología, sed de aprendizaje y curiosidad por descubrir cómo funcionan las cosas. Me encanta absorber nuevos conceptos, habilidades e ideas. Elevando mi nivel, me he embarcado en un viaje para sumergirme en el campo del desarrollo de software. Mi misión es no solo mejorar mis habilidades, sino también descubrir formas innovadoras de ofrecer un valor añadido a los clientes en el mundo empresarial a través de la fusión de mi experiencia en desarrollo de software. La exploración tiene sus caminos impredecibles y, a medida que me adentro más en el desarrollo de software, mi trayectoria puede evolucionar, al igual que la tecnología que usamos en nuestra vida diaria. Mi experiencia práctica en liderazgo en pequeñas empresas me ha inculcado la autonomía necesaria para llevar a cabo tareas sin supervisión constante. Tengo un don para la planificación, la dirección estratégica y un enfoque disciplinado en la gestión del tiempo para asegurarme de que mis proyectos reciban la atención dedicada que merecen. Hoy, mis objetivos están centrados en un solo propósito: acumular un profundo conocimiento en desarrollo de software que moldeará mi camino a medida que surjan nuevas posibilidades. Estoy emocionado por ver hacia dónde se expandirá mi experiencia en desarrollo de software.",
        "section_name": {
            "about": "Acerca de mí",
            "projects": "Proyectos",
            "skills": "Habilidades",
            "experience": "Experiencia"
        }
    },
    "projects": [
        {
            "title": "Refugio de Animales",
            "startDate": "2020",
            "description": "La aplicación más compleja en la que tuve la oportunidad de trabajar. Aprendí muchas tecnologías y mi código fue revisado por un gran mentor. La aplicación maneja todos los procesos de adopción y permite almacenar toda la documentación relacionada con la adopción de animales del refugio.",
            "images": [
                "images/portfolio/animal-shelter/p1.jpg",
                "images/portfolio/animal-shelter/p2.jpg"
            ],
            "url": "",
            "technologies": [
                {
                    "class": "devicon-angularjs-plain",
                    "name": "Angular"
                },
                {
                    "class": "devicon-typescript-plain",
                    "name": "TypeScript"
                },
                {
                    "class": "devicon-csharp-plain",
                    "name": "C#"
                }
            ]
        },
        {
            "title": "WWYR - What Would You Recommend",
            "startDate": "2023",
            "description": "WWYR es un centro web personalizado de recomendaciones de películas que permite a los usuarios recibir sugerencias de películas de personas que conocen y en quienes confían.",
            "images": [
                "images/portfolio/201Final_HomePage_Screenshot1.jpg",
                "images/portfolio/201Final_CommunityList_Screenshot.jpg"
            ],
            "url": "https://github.com",
            "technologies": [
                {
                    "class": "devicon-react-original",
                    "name": "React"
                },
                {
                    "class": "devicon-javascript-plain",
                    "name": "JavaScript"
                }
            ]
        },
        {
            "title": "Visor de Objetos 3D",
            "startDate": "2015",
            "description": "Uno de los primeros proyectos en los que trabajé como pasante. Tuve que preparar el front-end para una aplicación que muestra modelos 3D de edificios famosos. También fue mi primer proyecto en el framework Angular. ¡Aprendí mucho!",
            "images": [
                "images/portfolio/adventure/p1.jpg",
                "images/portfolio/adventure/p2.jpg"
            ],
            "url": "https://github.com",
            "technologies": [
                {
                    "class": "devicon-angularjs-plain",
                    "name": "Angular"
                },
                {
                    "class": "devicon-typescript-plain",
                    "name": "TypeScript"
                },
                {
                    "class": "devicon-csharp-plain",
                    "name": "C#"
                }
            ]
        }
    ],
    "experience": [
        {
            "company": "DefOpenSource",
            "title": "Desarrollador Front-End",
            "years": "10.2019 - presente",
            "mainTech": [
                "Angular 8/9/10"
            ],
            "technologies": [
                "API REST",
                "RxJS",
                "JavaScript",
                "Bootstrap",
                "MDBootstrap",
                "EF Core",
                "Angular Material"
            ]
        },
        {
            "company": "Serros Solutions",
            "title": "Practicante",
            "years": "01.2018 - 09.2019",
            "mainTech": [
                "Angular 7/8"
            ],
            "technologies": [
                "API REST",
                "RxJS",
                "Swagger",
                "JavaScript",
                "DHTMLX Gantt"
            ]
        }
    ]
}

